In [1]:
import pandas as pd

In [3]:
label=[1,2,3,4]
d={'a':1, 'b':2, 'c':3, 'd':4}
my_data=[20,40,60,80]

In [4]:
pd.Series(data=label,index=my_data)

20    1
40    2
60    3
80    4
dtype: int64

In [5]:
s1=pd.Series([5,6,7],['ok','ol','od'])
s1

ok    5
ol    6
od    7
dtype: int64

In [6]:
s2=pd.Series([6,8,7],['ok','op','ox'])
s2

ok    6
op    8
ox    7
dtype: int64

In [7]:
s1+s2

od     NaN
ok    11.0
ol     NaN
op     NaN
ox     NaN
dtype: float64

In [8]:
s1.loc['ok']                  #label based index location (loc)

5

In [11]:
s1.iloc[1]                    #integer based index location (iloc)

6

In [12]:
outside=['f1','f2','f3','f4','f5']
inside=[7,8,9,6,5]
hier=list(zip(outside,inside))
hier

[('f1', 7), ('f2', 8), ('f3', 9), ('f4', 6), ('f5', 5)]

In [6]:
import numpy as np
import pandas as pd
d1={'a':[1,2,np.nan], 'b':[3,4,np.nan], 'c':[5,np.nan,7]}
df=pd.DataFrame(d1)
df

     a    b    c
0  1.0  3.0  5.0
1  2.0  4.0  NaN
2  NaN  NaN  7.0

In [7]:
df.dropna()                              #missing values

     a    b    c
0  1.0  3.0  5.0

In [18]:
d2={'roll':[11,13,11,13,19],'name':['sony','ten','zee','hotstar','six'],'cost':[140,200,100,50,315]}
d2

{'roll': [11, 13, 11, 13, 19],
 'name': ['sony', 'ten', 'zee', 'hotstar', 'six'],
 'cost': [140, 200, 100, 50, 315]}

In [19]:
df1=pd.DataFrame(d2)
df1

   roll     name  cost
0    11     sony   140
1    13      ten   200
2    11      zee   100
3    13  hotstar    50
4    19      six   315

In [22]:
s=df1.groupby(by='roll')               #grouping
s

In [23]:
s.mean()

      cost
roll
11     120
13     125
19     315

In [24]:
s.sum()

      cost
roll
11     240
13     250
19     315

In [25]:
s.describe()

      cost
     count   mean         std    min    25%    50%    75%    max
roll
11     2.0  120.0   28.284271  100.0  110.0  120.0  130.0  140.0
13     2.0  125.0  106.066017   50.0   87.5  125.0  162.5  200.0
19     1.0  315.0         NaN  315.0  315.0  315.0  315.0  315.0

In [27]:
s.describe().transpose()

roll                11          13     19
cost count    2.000000    2.000000    1.0
     mean   120.000000  125.000000  315.0
     std     28.284271  106.066017    NaN
     min    100.000000   50.000000  315.0
     25%    110.000000   87.500000  315.0
     50%    120.000000  125.000000  315.0
     75%    130.000000  162.500000  315.0
     max    140.000000  200.000000  315.0